ka2_2024/src/Documents/ИзменениеУсловийПередачиВАренду/ИзменениеУсловийПередачиВАренду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеУсловийПередачиВАренду</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>InformationRegister.ГрафикОплатУслугПоДоходнойАренде</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.ГрафикНачисленияПроцентовПоДоходнойАренде</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ИнвестицииВАренду</registerRecords>
  <registerRecords>InformationRegister.ГрафикНачисленияУслугПоДоходнойАренде</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИзменениеУсловийДоговораАренды</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>АрендныеПлатежи</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НГЛСРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НГЛСУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикНачисленияПроцентовВведенВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияАренды</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикОплатУслуг</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАренде</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАрендеНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикНачисленияУслуг</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАренде</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАрендеНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикНачисленияПроцентов</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проценты</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/InformationRegisters/АрендованныеОС/АрендованныеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендованныеОС</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>НоминальнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПринятоКЗабалансовомуУчету</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаключенДоговорАренды</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Documents/ИзменениеУсловийПередачиВАренду/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент();
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ИзменениеУсловийДоговораАренды") Тогда
		ЗаполнитьНаОснованииИзмененияУсловийДоговораАренды(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИнициализироватьДокумент();
	
	ОбщегоНазначенияУТ.ОчиститьИдентификаторыДокумента(ЭтотОбъект, "ОС");

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ВнеоборотныеАктивы.ПроверитьСоответствиеДатыВерсииУчета(ЭтотОбъект, Истина, Отказ);
	
	ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ОС", "ОсновноеСредство", Отказ);
	
	ПараметрыРеквизитовОбъекта = УчетАрендованныхОСКлиентСервер.ЗначенияСвойствЗависимыхРеквизитов_ИзменениеУсловийПередачиВАренду(ЭтотОбъект, ВспомогательныеРеквизиты());
	ОбщегоНазначенияУТ.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(ПараметрыРеквизитовОбъекта, НепроверяемыеРеквизиты);
	
	ПроверитьОсновныеСредства(Отказ);
	
	УчетАрендованныхОС.ПроверитьГрафикиДоходнойАренды(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЗаполнитьРеквизитыПередЗаписью(Отказ, РежимЗаписи);
	
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "ОС");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

Функция ВспомогательныеРеквизиты()

	ВспомогательныеРеквизиты = Новый Структура;
	ВспомогательныеРеквизиты.Вставить("РеквизитыДоговора", УчетАрендованныхОС.РеквизитыДоговораКонтрагента(Договор));

	Возврат ВспомогательныеРеквизиты;
	
КонецФункции

Процедура ПроверитьОсновныеСредства(Отказ)
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ТипДоговора, ДоговорАренды");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ втТаблицаОС
	|ИЗ
	|	&ТаблицаОС КАК ТаблицаОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереданныеВАрендуОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ втПереданныеВАрендуОС
	|ИЗ
	|	РегистрСведений.ПереданныеВАрендуОС.СрезПоследних(
	|			&Дата,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						втТаблицаОС.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						втТаблицаОС КАК втТаблицаОС)
	|				И Регистратор <> &Ссылка) КАК ПереданныеВАрендуОССрезПоследних
	|ГДЕ
	|	ПереданныеВАрендуОССрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПереданоВАренду)
	|	И ПереданныеВАрендуОССрезПоследних.Договор <> &Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендованныеОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	АрендованныеОССрезПоследних.Договор КАК Договор,
	|	АрендованныеОССрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ втАрендованныеОС
	|ИЗ
	|	РегистрСведений.АрендованныеОС.СрезПоследних(
	|			&Дата,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					втТаблицаОС.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					втТаблицаОС КАК втТаблицаОС)) КАК АрендованныеОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(УсловияДоговоровАрендыСрезПоследних.ДатаНачалаАренды, ГОД, УсловияДоговоровАрендыСрезПоследних.СрокЛет), МЕСЯЦ, УсловияДоговоровАрендыСрезПоследних.СрокМес), ДЕНЬ, УсловияДоговоровАрендыСрезПоследних.СрокДней - 1) КАК ДатаОкончанияАренды,
	|	УсловияДоговоровАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	УсловияДоговоровАрендыСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ втУсловияДоговораАренды
	|ИЗ
	|	РегистрСведений.УсловияДоговоровАренды.СрезПоследних(
	|			&Дата,
	|			Договор В
	|				(ВЫБРАТЬ
	|					втАрендованныеОС.Договор КАК Договор
	|				ИЗ
	|					втАрендованныеОС КАК втАрендованныеОС)) КАК УсловияДоговоровАрендыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендованныеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	АрендованныеОС.Договор КАК Договор,
	|	АрендованныеОС.Состояние КАК Состояние,
	|	УсловияДоговораАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	УсловияДоговораАренды.ДатаНачалаАренды КАК ДатаНачалаАренды
	|ПОМЕСТИТЬ втАрендованныеОССДатамиАренды
	|ИЗ
	|	втАрендованныеОС КАК АрендованныеОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУсловияДоговораАренды КАК УсловияДоговораАренды
	|		ПО АрендованныеОС.Договор = УсловияДоговораАренды.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплатУслуг.Дата КАК Дата,
	|	ГрафикОплатУслуг.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ втГрафикОплат
	|ИЗ
	|	&ГрафикОплатУслуг КАК ГрафикОплатУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ГрафикОплат.Дата) КАК Дата,
	|	ГрафикОплат.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ втДатыОкончанияПередачи
	|ИЗ
	|	втГрафикОплат КАК ГрафикОплат
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплат.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ДатыОкончанияПередачи.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияСубаренды,
	|	ЕСТЬNULL(АрендованныеОС.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияАренды,
	|	ЕСТЬNULL(АрендованныеОС.ДатаНачалаАренды, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаАренды,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВАренду
	|				И АрендованныеОС.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВАренде), ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ЗаключенДоговорАренды))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОСАрендовано,
	|	ВЫБОР
	|		КОГДА НЕ ПереданныеВАрендуОС.ОсновноеСредство ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОСПереданоВАрендуРанее,
	|	ВЫБОР
	|		КОГДА &ЭтоСубаренда
	|				И АрендованныеОС.Договор ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОСНеАрендовано,
	|	ВЫБОР
	|		КОГДА &ЭтоСубаренда
	|				И НЕ АрендованныеОС.Договор ЕСТЬ NULL
	|				И АрендованныеОС.Договор <> &ДоговорАренды
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоговорАрендыНеСоответствует,
	|	ВЫБОР
	|		КОГДА &ЭтоСубаренда
	|				И ЕСТЬNULL(ДатыОкончанияПередачи.Дата, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(АрендованныеОС.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаОкончанияПередачиБольшеСрокаАренды,
	|	ВЫБОР
	|		КОГДА &ЭтоСубаренда
	|				И &Дата < ЕСТЬNULL(АрендованныеОС.ДатаНачалаАренды, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаПередачиВСубарендуМеньшеДатыНачалаАренды
	|ИЗ
	|	втТаблицаОС КАК ТаблицаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАрендованныеОССДатамиАренды КАК АрендованныеОС
	|		ПО ТаблицаОС.ОсновноеСредство = АрендованныеОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатыОкончанияПередачи КАК ДатыОкончанияПередачи
	|		ПО ТаблицаОС.ОсновноеСредство = ДатыОкончанияПередачи.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПереданныеВАрендуОС КАК ПереданныеВАрендуОС
	|		ПО ТаблицаОС.ОсновноеСредство = ПереданныеВАрендуОС.ОсновноеСредство
	|ГДЕ
	|	(&ЭтоПередачаВАренду
	|				И АрендованныеОС.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВАренде), ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ЗаключенДоговорАренды))
	|			ИЛИ НЕ ПереданныеВАрендуОС.ОсновноеСредство ЕСТЬ NULL
	|			ИЛИ &ЭтоСубаренда
	|				И АрендованныеОС.Договор ЕСТЬ NULL
	|			ИЛИ &ЭтоСубаренда
	|				И НЕ АрендованныеОС.Договор ЕСТЬ NULL
	|				И АрендованныеОС.Договор <> &ДоговорАренды
	|			ИЛИ &ЭтоСубаренда
	|				И ЕСТЬNULL(ДатыОкончанияПередачи.Дата, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(АрендованныеОС.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1))
	|			ИЛИ &ЭтоСубаренда
	|				И &Дата < ЕСТЬNULL(АрендованныеОС.ДатаНачалаАренды, ДАТАВРЕМЯ(1, 1, 1)))";
	
	Запрос.УстановитьПараметр("ЭтоСубаренда", РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.Субаренда);
	Запрос.УстановитьПараметр("ЭтоПередачаВАренду", РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.ПередачаВАренду);
	Запрос.УстановитьПараметр("ДоговорАренды", РеквизитыДоговора.ДоговорАренды);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("ТаблицаОС", ОС.Выгрузить(, "НомерСтроки, ОсновноеСредство"));
	Запрос.УстановитьПараметр("ГрафикОплатУслуг", ГрафикОплатУслуг.Выгрузить(, "Дата, ОсновноеСредство"));

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ШаблонСообщенияОСАрендовано =
		НСтр("ru = 'В строке %1 списка ""Основные средства"", указано основное средство, находящееся в аренде. Такое ОС можно передать в аренду по договору с типом ""Субаренда""'");
	ШаблонСообщенияОСПереданоВАрендуРанее =
		НСтр("ru = 'В строке %1 списка ""Основные средства"", указано основное средство, уже переданное в аренду ранее'");
	ШаблонСообщенияОСНеАрендовано =
		НСтр("ru = 'В строке %1 списка ""Основные средства"", указано основное средство, не находящееся в аренде. Такое ОС можно передать в аренду по договору с типом ""Передача в аренду""'");
	ШаблонСообщенияДоговорАрендыНеСоответствует =
		НСтр("ru = 'В строке %1 списка ""Основные средства"", договор аренды арендованного основного средства не соответствует договору аренды, указанному в свойствах договора контрагента'");
	ШаблонСообщенияДатаОкончанияПередачиБольшеСрокаАренды =
		НСтр("ru = 'В строке %1 списка ""Основные средства"" дата окончания передачи в субаренду основного средства (%2) больше даты окончания договора аренды (%3)'");
	ШаблонСообщенияДатаПередачиВСубарендуМеньшеДатыНачалаАренды =
		НСтр("ru = 'В строке %1 списка ""Основные средства"" дата передачи в субаренду основного средства (%2) меньше даты начала договора аренды (%3)'");

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОСАрендовано Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияОСАрендовано, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "ОсновноеСредство");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
		
		Если Выборка.ОСПереданоВАрендуРанее Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияОСПереданоВАрендуРанее, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "ОсновноеСредство");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
		
		Если Выборка.ОСНеАрендовано Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияОСНеАрендовано, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "ОсновноеСредство");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
		
		Если Выборка.ДоговорАрендыНеСоответствует Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияДоговорАрендыНеСоответствует, Выборка.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "ОсновноеСредство");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
		
		Если Выборка.ДатаОкончанияПередачиБольшеСрокаАренды Тогда
			ТекстСообщения = СтрШаблон(
				ШаблонСообщенияДатаОкончанияПередачиБольшеСрокаАренды,
				Выборка.НомерСтроки,
				Формат(Выборка.ДатаОкончанияСубаренды, "ДЛФ=D"),
				Формат(Выборка.ДатаОкончанияАренды, "ДЛФ=D"));
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "ОсновноеСредство");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
		
		Если Выборка.ДатаПередачиВСубарендуМеньшеДатыНачалаАренды Тогда
			ТекстСообщения = СтрШаблон(
				ШаблонСообщенияДатаПередачиВСубарендуМеньшеДатыНачалаАренды,
				Выборка.НомерСтроки,
				Формат(Дата, "ДЛФ=D"),
				Формат(Выборка.ДатаНачалаАренды, "ДЛФ=D"));
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", Выборка.НомерСтроки, "ОсновноеСредство");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "", Отказ);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПередЗаписью(Отказ, РежимЗаписи)
	
	УчетАрендованныхОС.УдалитьНеактуальныеСтрокиГрафиков(ЭтотОбъект);
	РеквизитыДоговора = УчетАрендованныхОС.РеквизитыДоговораКонтрагента(Договор);
	УчетАрендованныхОС.ЗаполнитьСуммуАрендныхПлатежей(ЭтотОбъект, РеквизитыДоговора.ВалютаВзаиморасчетов);
	
	ГрафикПроцентовАктуализирован = Ложь;
	Если НЕ ДополнительныеСвойства.Свойство("ГрафикПроцентовАктуализирован", ГрафикПроцентовАктуализирован) Тогда
		ГрафикПроцентовАктуализирован = Ложь;
	КонецЕсли;
	Если НЕ ГрафикПроцентовАктуализирован Тогда
		ПараметрыРасчета = УчетАрендованныхОС.ПараметрыРасчетаСтавокПроцентовДоходнойАренды(ЭтотОбъект, РеквизитыДоговора);
		ПараметрыРасчета.ВыводитьСообщения = Ложь;
		УчетАрендованныхОС.РассчитатьСтавкиПроцентыДоходнойАренды(ПараметрыРасчета);
		ГрафикНачисленияПроцентов.Загрузить(ПараметрыРасчета.ГрафикНачисленияПроцентов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииИзмененияУсловийДоговораАренды(ДанныеЗаполнения)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ИзменениеУсловийПередачиВАренду.ЗаполнитьНаОснованииИзмененияУсловийДоговораАренды(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
